In [17]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pickle

In [18]:
dataset=pd.read_csv('salary_data.csv')

In [33]:
dataset

  Experience  Test_Score  Interview_score  Salary
0       zero    8.000000                9   50000
1       zero    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   75000
7     eleven    7.000000                8   80000

In [19]:
dataset

  Experience  Test_Score  Interview_score  Salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   75000
7     eleven         7.0                8   80000

In [20]:
dataset['Experience'].fillna('zero',inplace=True)
dataset['Test_Score'].fillna(dataset['Test_Score'].mean(),inplace=True)

In [21]:
X=dataset.iloc[:,:3]
X

  Experience  Test_Score  Interview_score
0       zero    8.000000                9
1       zero    8.000000                6
2       five    6.000000                7
3        two   10.000000               10
4      seven    9.000000                6
5      three    7.000000               10
6        ten    7.857143                7
7     eleven    7.000000                8

In [27]:
def convert_to_int(word):
    word_dict={'one':1,'two':2,
              'three':3,'four':4,
              'five':5,'six':6,
              'seven':7,'eight':8,
               'nine':9,'ten':10,
              'eleven':11,'twelve':12,
              'zero':0}
    return word_dict[word]

In [28]:
X['Experience']=X['Experience'].apply(lambda x:convert_to_int(x))

In [29]:
X

   Experience  Test_Score  Interview_score
0           0    8.000000                9
1           0    8.000000                6
2           5    6.000000                7
3           2   10.000000               10
4           7    9.000000                6
5           3    7.000000               10
6          10    7.857143                7
7          11    7.000000                8

In [34]:
y=dataset.iloc[:,-1]

In [38]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    75000
7    80000
Name: Salary, dtype: int64

In [39]:
from sklearn.linear_model import LinearRegression
regressor=LinearRegression()
regressor.fit(X,y)

LinearRegression()

In [40]:
pickle.dump(regressor,open('model.pkl','wb'))

In [42]:
model=pickle.load(open('model.pkl','rb'))
print(model.predict([[2,9,6]]))

[53558.13453671]